tutorials/inter4NFFoam/microfluidic2D/0/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletu
    {
        type            fixedValue;
        value           uniform 1;
    }

    upperWalls
    {
        type            zeroGradient;
    }

    frontAndBacku
    {
        type            empty;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    outlet
    {
        type            zeroGradient;
    }

    bottom
    {
        type           constantAlphaContactAngle;
        theta0         160;
        limit          gradient;
        value          uniform 0;
    }

    topLeft
    {
        type           constantAlphaContactAngle;
        theta0         160;
        limit          gradient;
        value          uniform 0;
    }

    topRight
    {
        type           constantAlphaContactAngle;
        theta0         160;
        limit          gradient;
        value          uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
