tutorials/inter4NFFoam/microfluidic2D/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   staticFvMesh;//dynamicRefineFvMesh;

dynamicRefineFvMeshCoeffs
{
    refineInterval  1;
    field           alpha1;
    lowerRefineLevel 0.001;
    upperRefineLevel 0.999;
    unrefineLevel   10;
    nBufferLayers   1;
    maxRefinement   2;
    maxCells        200000;
    correctFluxes
    (
        (
            phi
            U
        )
    );
    dumpLevel       true;
}


// ************************************************************************* //
