tutorials/inter4NFFoam/microfluidic2D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default				Euler;
}

gradSchemes
{
    default				Gauss linear;
    grad(U)				Gauss linear;
    grad(alpha1)			Gauss linear;
}

divSchemes
{
    div(rho*phi,U)			Gauss limitedLinearV 1;
    div(phi,alpha)			Gauss vanLeer01;
    div(phirb,alpha)			Gauss interfaceCompression;
}

laplacianSchemes
{
    default				Gauss linear corrected;
}

interpolationSchemes
{
    default				linear;
}

snGradSchemes
{
    default				corrected;
}


// ************************************************************************* //
